import holidays

FIRST_DAY_OF_TRAIN_PRD = (2013, 1, 1)

LAST_DAY_OF_TRAIN_PRD = (2015, 10, 31)

FIRST_DAY_OF_TEST_PRD = (2015, 11, 1)

# Russian public holidays in 2012, 2013, 2014, 2015, and 2016
PUBLIC_HOLIDAYS = holidays.Russia(years=[2012, 2013, 2014, 2015, 2016])
PUBLIC_HOLIDAY_DTS = list(PUBLIC_HOLIDAYS.keys())

OLYMPICS2014 = ("2/7/2014", "2/23/2014")

WORLDCUP2014 = ("6/12/2014", "7/13/2014")

# city populations as of 1/1/2020
# (source: https://rosstat.gov.ru/storage/mediabank/CcG8qBhP/mun_obr2020.rar, accessed 11/17/2020):
CITY_POP = [
    ("РостовНаДону", 1137904.0, "47°14′26″ с. ш. 39°42′38″ в. д.", "UTC+3"),
    ("Н.Новгород", 1252236.0, "56°19′37″ с. ш. 44°00′27″ в. д.", "UTC+3"),
    ("Казань", 1257391.0, "55°47′27″ с. ш. 49°06′52″ в. д.", "UTC+3"),
    ("Новосибирск", 1625631.0, "55°01′ с. ш. 82°55′ в. д.", "UTC+7"),
    ("Воронеж", 1058261.0, "51°40′18″ с. ш. 39°12′38″ в. д.", "UTC+3"),
    ("Красноярск", 1093771.0, "56°00′43″ с. ш. 92°52′17″ в. д.", "UTC+7"),
    ("Ярославль", 608353.0, "57°37′ с. ш. 39°51′ в. д.", "UTC+3"),
    ("Тюмень", 807271.0, "57°09′ с. ш. 65°32′ в. д.", "UTC+5"),
    ("Сургут", 380632.0, "61°15′00″ с. ш. 73°26′00″ в. д.", "UTC+5"),
    ("Омск", 1154507.0, "54°58′ с. ш. 73°23′ в. д.", "UTC+6"),
    ("Волжский", 323906.0, "48°47′ с. ш. 44°46′ в. д.", "UTC+4"),
    ("Уфа", 1128787.0, "54°44′ с. ш. 55°58′ в. д.", "UTC+5"),
    ("Якутск", 322987.0, "62°01′38″ с. ш. 129°43′55″ в. д.", "UTC+9"),
    ("Балашиха", 507366.0, "55°48′ с. ш. 37°56′ в. д.", "UTC+3"),
    ("Вологда", 310302.0, "59°13′ с. ш. 39°54′ в. д.", "UTC+3"),
    ("Жуковский", 107560.0, "55°36′04″ с. ш. 38°06′58″ в. д.", "UTC+3"),
    ("Калуга", 332039.0, "54°32′00″ с. ш. 36°16′00″ в. д.", "UTC+3"),
    ("Коломна", 140129.0, "55°05′38″ с. ш. 38°46′05″ в. д.", "UTC+3"),
    ("Курск", 452976.0, "51°43′ с. ш. 36°11′ в. д.", "UTC+3"),
    ("Москва", 12678079.0, "55°45′21″ с. ш. 37°37′04″ в. д.", "UTC+3"),
    ("Мытищи", 235504.0, "55°55′ с. ш. 37°44′ в. д.", "UTC+3"),
    ("СПб", 5398064.0, "59°57′ с. ш. 30°19′ в. д.", "UTC+3"),
    ("Самара", 1156659.0, "53°11′ с. ш. 50°07′ в. д.", "UTC+4"),
    ("Сергиев", 100335.0, "56°18′00″ с. ш. 38°08′00″ в. д.", "UTC+3"),
    ("Томск", 576624.0, "56°29′19″ с. ш. 84°57′08″ в. д.", "UTC+7"),
    ("Химки", 259550.0, "55°53′21″ с. ш. 37°26′42″ в. д.", "UTC+3"),
    ("Чехов", 73321.0, "55°08′42″ с. ш. 37°27′20″ в. д.", "UTC+3"),
    ("Адыгея", 932629.0, "45°02′00″ с. ш. 38°59′00″ в. д.", "UTC+3"),
]
